Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/returning_to_education/night_classes.html.txt.tmx
Source language: en
Languages: ga

source: Whether you are looking for a sociable way to learn a language or whether you are looking to gain a particular formal qualification, the range of evening classes available throughout Ireland should provide you with what you need
ga: Bíodh go bhfuil tú ag lorg bealach sóisialta chun teanga a fhoghlaim nó go bhfuil tú ag iarraidh cáilíocht foirmeálta ar leith a bhaint amach, ba chóir go mbeadh do rogha féin le fáil agat as an réimse ranganna oíche atá ar fáil ar fud na tíre

source: Evening classes take place during term time in Education and Training Boards (ETBs), schools, colleges and universities throughout the country
ga: Bíonn ranganna oíche ar siúl i rith an téarma in Boird Oideachais agus Oiliúna (BOO), scoileanna, coláistí agus ollscoileanna ar fud na tíre

source: The courses on offer vary from centre to centre so it is worth looking around if you have a particular interest you would like to pursue
ga: Bíonn cúrsaí difriúla ar fáil sna hionaid éagsúla agus mar sin is fiú go mór breathnú thart má tá ábhar ar leith a chuireann tú spéis ann

source: In general you need to enrol a few weeks before the course starts
ga: Go ginearálta bíonn ort clárú cúpla seachtain sula dtosnaíonn an cúrsa

source: Enrolment takes place around mid September, again in mid-January and, in those centres with a summer term, around mid-March
ga: Bíonn clárú ar siúl go hiondúil timpeall lár mhí Meán Fómhair, arís i lár mí Eanáir, agus, sna hionaid ina mbíonn téarmaí samhradh, timpeall lár mhí Márta

source: Normally, evening classes are advertised locally - for example in your local newspaper, community centre, health centre, school, parish hall, etc
ga: De ghnáth, fógraítear ranganna oíche san áit - mar shampla, do pháipéir áitiúil, ionad pobal, ionad sláinte, halla paróiste

source: Your local ETB, college and secondary school will also be able to give you details on the courses that are on in your area and when they begin
ga: Is féidir le do BOO, choláiste agus iarbhunscoil a thabhairt duit sonraí chúrsaí i d'áit agus dáta tosaithe

source: Education and Training Boards
ga: Boird Oideachais agus Oiliúna

source: Since 1 July 2013, Education and Training Boards (ETBs) replaced Vocational Educational Committees (VECs)
ga: Ó 1 Iúil 2013, cuirfear Boird Oideachais agus Oiliúna (BOO) in áit coistí gairmoideachais

source: All services provided by VECs will continue to be provided by ETBs
ga: Leanfaidh na BOO an uile sheirbhíse soláthartha ag na coistí gairmoideachais a sholáthar

source: The majority of evening classes are unaccredited and, as a result, you will not need any formal qualifications to take part
ga: Ní bhíonn teastasaíocht ag baint le formhór ranganna oíche agus dá bharr seo, ní bhíonn aon cháilíochtaí foirmeálta ag teastáíl uait chun páirt a ghlacadh iontu

source: However, if you are interested in a course that offers a particular qualification, you may be required to have some prior qualification or experience in order to be eligible
ga: Má tá suim agat, áfach, páirt a ghlacadh i gcúrsa a bhfuil cáilíocht ar leith le fáil as, b'fhéidir go mbeadh ort cáilíocht nó taithí éigin a bheith agat roimh ré ionas go bhféadfaidh tú páirt a ghlacadh iontu

source: Get in touch with the course organisers in advance, to check if there are any academic or professional qualifications required for your course
ga: Téigh i dteagmháil le heagraithe cúrsaí roimh ré chun seiceáil an bhfuil aon cháilíocht acadúil nó gairmiúil is gá don chúrsa

source: The only requirement for most evening classes is that you pay the fee in advance
ga: Sé an t-aon rud amháin a mbíonn gá leis i gcóir furmhór ranganna oíche ná go n-íocfá an táille roimh ré

source: Evening classes are generally self-funding so the cost of your course will relate directly to the cost of the materials you will need
ga: Is iondúil go mbíonn ranganna oíche ag íoc astu féin agus mar sin bainfidh costas do chúrsa go díreach le costas na hábhair a bheidh ag teastáil uait dó

source: As a result, costs may differ greatly from course to course
ga: Dá bharr seo, is féidir difear an-mhór a bheith idir costas na gcúrsaí éagsúla

source: The ETB usually organises a registration evening where you go along in person, sign up and pay for the course in advance
ga: Bíonn oíche clárú ag an BOO go hiondúil áit a dtéann tú féin ann chun clárú agus íoc as an gcúrsa roimh ré

source: Contact information for all ETBs
ga: Tá sonraí teagmhála an iomlán BOOs in Éirinn anseo
